#+title: Network address listing exercises
#+author: Marcus Birkenkrahe
#+SEQ_TODO: TODO NEXT IN_PROGRESS | DONE
#+startup: overview hideblocks indent entitiespretty:
#+property: header-args:C :main yes :includes <stdio.h> :results output :exports both:
#+property: header-args:python :session *Python* :python python3 :results output :exports both:
#+src R :file :session *R* :results graphics output file :exports both:
#+property: header-args:C++ :main yes :includes <iostream> :results output :exports both:
* DONE Match =ip addr show= and =unix_list.c=

- =unix_list.c=:
  #+begin_src C
    #include <sys/socket.h>
    #include <netdb.h>
    #include <ifaddrs.h>
    #include <stdio.h>
    #include <stdlib.h>


    int main() {

      struct ifaddrs *addresses;

      if (getifaddrs(&addresses) == -1) {
        printf("getifaddrs call failed\n");
        return -1;
      }

      struct ifaddrs *address = addresses;
      while(address) {
        if (address->ifa_addr == NULL) {
          address = address->ifa_next;
          continue;
        }
        int family = address->ifa_addr->sa_family;
        if (family == AF_INET || family == AF_INET6) {

          printf("%s\t", address->ifa_name);
          printf("%s\t", family == AF_INET ? "IPv4" : "IPv6");

          char ap[100];
          const int family_size = family == AF_INET ?
        sizeof(struct sockaddr_in) : sizeof(struct sockaddr_in6);
          getnameinfo(address->ifa_addr,
                  family_size, ap, sizeof(ap), 0, 0, NI_NUMERICHOST);
          printf("\t%s\n", ap);

        }
        address = address->ifa_next;
      }


      freeifaddrs(addresses);
      return 0;
    }

  #+end_src

- =ip addr show=:
  #+begin_src bash :results output
    ip addr show
  #+end_src

  #+RESULTS:
  #+begin_example
  1: lo: <LOOPBACK,UP,LOWER_UP> mtu 65536 qdisc noqueue state UNKNOWN group default qlen 1000
      link/loopback 00:00:00:00:00:00 brd 00:00:00:00:00:00
      inet 127.0.0.1/8 scope host lo
         valid_lft forever preferred_lft forever
      inet6 ::1/128 scope host
         valid_lft forever preferred_lft forever
  2: wlp0s20f3: <BROADCAST,MULTICAST,UP,LOWER_UP> mtu 1500 qdisc noqueue state UP group default qlen 1000
      link/ether 04:56:e5:25:d2:5d brd ff:ff:ff:ff:ff:ff
      inet 10.1.6.233/22 brd 10.1.7.255 scope global dynamic noprefixroute wlp0s20f3
         valid_lft 85877sec preferred_lft 85877sec
      inet6 fe80::28f6:cc78:32ae:3b68/64 scope link noprefixroute
         valid_lft forever preferred_lft forever
  #+end_example

- List interfaces and IPs from both in a table:

  | Name   |       Unix IP | ip addr IP       |
  |--------+---------------+------------------|
  | lo     |     127.0.0.1 | 127.0.0.1/8      |
  | enp4s0 | 192.168.1.250 | 192.168.1.250/24 |
  | wlo1   | 192.168.68.56 | 192.168.68.56/24 |

- What's the difference? Explain!
  #+begin_quote
  - ~ip addr show~ includes netmasks (e.g., ~/24~), MAC addresses,
    and inactive interfaces (e.g., DOWN state) that ~unix_list.c~
    skips (requires ~ifa_addr~).
  - ~unix_list.c~ only shows active IPv4/IPv6 addresses.
  #+end_quote

* TODO Filter one interface only

- Include ~<string.h>~

- Include =string.h= at the top of your file
  
- Add this inside the ~while~ loop (including the code block =name=):
  #+name: filter loopback addresses
  #+begin_src C
    // Skip address if it's not a "lo" interface
    if (strcmp(address->ifa_name,"lo") != 0) {
      address = address->ifa_next;
      continue;
     }
  #+end_src

- Test the file by inserting the code block name inside double
  brackets << and >> at the right place of the program.
  #+begin_src C :noweb yes
    #include <string.h>
    #include <sys/socket.h>
    #include <netdb.h>
    #include <ifaddrs.h>
    #include <stdio.h>
    #include <stdlib.h>

    int main() {

      struct ifaddrs *addresses;

      if (getifaddrs(&addresses) == -1) {
        printf("getifaddrs call failed\n");
        return -1;
      }

      struct ifaddrs *address = addresses;
      while(address) {
        <<filter loopback addresses>>
        if (address->ifa_addr == NULL) { 
          address = address->ifa_next;
          continue;
        }
        int family = address->ifa_addr->sa_family;
        if (family == AF_INET || family == AF_INET6) {

          printf("%s\t", address->ifa_name);
          printf("%s\t", family == AF_INET ? "IPv4" : "IPv6");

          char ap[100];
          const int family_size = family == AF_INET ?
    	sizeof(struct sockaddr_in) : sizeof(struct sockaddr_in6);
          getnameinfo(address->ifa_addr,
    		  family_size, ap, sizeof(ap), 0, 0, NI_NUMERICHOST);
          printf("\t%s\n", ap);

        }
        address = address->ifa_next;
      }


      freeifaddrs(addresses);
      return 0;
    }

  #+end_src

  #+RESULTS:
  : lo	IPv4		127.0.0.1
  : lo	IPv6		::1

